In [2]:
import pandas as pd
import numpy as np

In [6]:
class display(object):
    template = """<div style="float: left; padding: 10px";">
    <p style='font-family: "Courier New", Courier, monospace'>{0}{1}"""
    def __init__(self, *args):
        self.args = args

    def _repr_html_(self):
        return '\n'.join(self.tempalte.format(a,eval(a)._repr_html_())
                         for a in self.args)

    def _repr_(self):
        return '\n\n'.join(a+'\n'+repr(eval(a))
                           for a in self.args)

In [11]:
df1 = pd.DataFrame({'employee': ['Bob','Jake','Lisa','Sue'],
                   'group': ['Accounting','Engineering','Engineering', 'HR'] })
df2 = pd.DataFrame({'employee': ['Lisa','Bob','Jake','Sue'],
                   'hire_data': ['2004','2008','2012','2014'] })
display('df1', 'df2')

'df1'

'df2'

In [9]:
from IPython.display import display

# Displaying the dataframes
display(df1)
display(df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

  employee hire_data
0     Lisa      2004
1      Bob      2008
2     Jake      2012
3      Sue      2014

In [13]:
df3 = pd.merge(df1,df2)
df3

  employee        group hire_data
0      Bob   Accounting      2008
1     Jake  Engineering      2012
2     Lisa  Engineering      2004
3      Sue           HR      2014

In [24]:
df4 = pd.DataFrame({'group': ['Accounting','Engineering','HR'],
                   'supervisor': ['Carly', 'Guido','Steve']})
display('df3', 'df4', 'pd.merge(df3,df3)')

'df3'

'df4'

'pd.merge(df3,df3)'

In [26]:
df3 = pd.merge(df3,df4)
df3

  employee        group hire_data supervisor
0      Bob   Accounting      2008      Carly
1     Jake  Engineering      2012      Guido
2     Lisa  Engineering      2004      Guido
3      Sue           HR      2014      Steve

In [38]:
df5 = pd.DataFrame({'group': ['Accounting','Accounting', 'Engineering','Engineering','HR','HR'],
                    'skills': [ 'math','spreadsheets','software', 'math', 'spreadsheets', 'organization']})
display('df1', 'df5', 'pd.merge(df1,df5)')

'df1'

'df5'

'pd.merge(df1,df5)'

In [39]:
display(df1)
display(df5)
display(pd.merge(df1, df5))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering      software
3  Engineering          math
4           HR  spreadsheets
5           HR  organization

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering      software
3     Jake  Engineering          math
4     Lisa  Engineering      software
5     Lisa  Engineering          math
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [58]:
#lets use it only with 'employee' column

display('df1', 'df2', "pd.merge(df1,df2, on='employee')")

merged_df = pd.merge(df1, df2, on='employee')

display(df1)
display(df2)
display(merged_df)

'df1'

'df2'

"pd.merge(df1,df2, on='employee')"

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

  employee hire_data
0     Lisa      2004
1      Bob      2008
2     Jake      2012
3      Sue      2014

  employee        group hire_data
0      Bob   Accounting      2008
1     Jake  Engineering      2012
2     Lisa  Engineering      2004
3      Sue           HR      2014

In [87]:
df3 = pd.DataFrame({'name': ['Bob','Jake','Lisa','Sue'],
                   'salary': ['7000','8000','12000','90000']})
display ('df1', 'df3' , 'pd.merge(df1, df3, left_on="employee", right_on="name")')

# OR 

merged_df = pd.merge(df1, df3,  left_on="employee", right_on="name")

'df1'

'df3'

'pd.merge(df1, df3, left_on="employee", right_on="name")'

In [89]:
display(df1)
display(df3)
merged_df

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

   name salary
0   Bob   7000
1  Jake   8000
2  Lisa  12000
3   Sue  90000

  employee        group  name salary
0      Bob   Accounting   Bob   7000
1     Jake  Engineering  Jake   8000
2     Lisa  Engineering  Lisa  12000
3      Sue           HR   Sue  90000

In [90]:
pd.merge(df1, df3, left_on="employee", right_on="name").drop('name', axis = 1)

  employee        group salary
0      Bob   Accounting   7000
1     Jake  Engineering   8000
2     Lisa  Engineering  12000
3      Sue           HR  90000

In [93]:
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
display ('df1a' , 'df2a')

'df1a'

'df2a'

In [98]:
df1a

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

In [99]:
df2a

         hire_data
employee
Lisa          2004
Bob           2008
Jake          2012
Sue           2014

In [100]:
display('df1a', 'df2a',
       "pd.merge(df1a, df2a , left_index=True, right_index=True )")

'df1a'

'df2a'

'pd.merge(df1a, df2a , left_index=True, right_index=True )'

In [107]:
display(df1)
display(df3)
pd.merge(df1a, df2a , left_index=True, right_index=True)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

   name salary
0   Bob   7000
1  Jake   8000
2  Lisa  12000
3   Sue  90000

                group hire_data
employee
Bob        Accounting      2008
Jake      Engineering      2012
Lisa      Engineering      2004
Sue                HR      2014

In [109]:
df1a.join(df2a)

                group hire_data
employee
Bob        Accounting      2008
Jake      Engineering      2012
Lisa      Engineering      2004
Sue                HR      2014

In [110]:
display('df1a','df3', "df.merge(df1a, df3, left_index=True, right_on='name')")

'df1a'

'df3'

"df.merge(df1a, df3, left_index=True, right_on='name')"

In [118]:
display(df1a)
display(df3)
pd.merge(df1a, df3, left_index=True, right_on='name')

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

   name salary
0   Bob   7000
1  Jake   8000
2  Lisa  12000
3   Sue  90000

         group  name salary
0   Accounting   Bob   7000
1  Engineering  Jake   8000
2  Engineering  Lisa  12000
3           HR   Sue  90000

In [124]:
df6 = pd.DataFrame({'name':['Peter','Paul','Mary'],
                   'food':['fish','beans','bread']},
                   columns=['name','food'])
df7 = pd.DataFrame({'name':['Mary', 'Joseph'],
                   'drink':['wine', 'beer']},
                  columns=['name', 'drink'])
display('df6', 'df7', 'pd.merge(df6,df7)')

'df6'

'df7'

'pd.merge(df6,df7)'

In [126]:
display(df6)
display(df7)
pd.merge(df6,df7)

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

     name drink
0    Mary  wine
1  Joseph  beer

   name   food drink
0  Mary  bread  wine

In [128]:
pd.merge(df6,df7, how='inner')

   name   food drink
0  Mary  bread  wine

In [129]:
pd.merge(df6,df7, how='outer')

     name   food drink
0  Joseph    NaN  beer
1    Mary  bread  wine
2    Paul  beans   NaN
3   Peter   fish   NaN

In [130]:
pd.merge(df6,df7, how='left')

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [140]:
df8 = pd.DataFrame({'name':['Bob','Jake','Lisa','Sue'],
                   'rank':['1','2','3','4']})
df9 = pd.DataFrame({'name':['Bob','Jake','Lisa','Sue'],
                   'rank':['3','1','4','2']})
display('df8', 'df9', 'pd.merge(df8,df9, on="name")')

'df8'

'df9'

'pd.merge(df8,df9, on="name")'

In [142]:
display(df8)
display(df9)
pd.merge(df8,df9, on="name")

   name rank
0   Bob    1
1  Jake    2
2  Lisa    3
3   Sue    4

   name rank
0   Bob    3
1  Jake    1
2  Lisa    4
3   Sue    2

   name rank_x rank_y
0   Bob      1      3
1  Jake      2      1
2  Lisa      3      4
3   Sue      4      2

In [143]:
pd.merge(df8,df9, on="name", suffixes = ["_L","_R"])

   name rank_L rank_R
0   Bob      1      3
1  Jake      2      1
2  Lisa      3      4
3   Sue      4      2

In [150]:
repo = "https://raw.githubusercontent.com/jakevdp/data-USstates/master"
!mkdir -p data
!curl -o data/state-population.csv {repo}/state-population.csv
!curl -o data/state-areas.csv {repo}/state-areas.csv
!curl -o data/state-abbrevs.csv {repo}/state-abbrevs.csv

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100 57935  100 57935    0     0  63853      0 --:--:-- --:--:-- --:--:-- 63875
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100   835  100   835    0     0   2918      0 --:--:-- --:--:-- --:--:--  2919
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100   872  100   872    0     0   4799      0 --:--:-- --:--:-- --:--:--  4791

In [156]:
pop = pd.read_csv('data/state-population.csv')
areas = pd.read_csv('data/state-areas.csv')
abbrevs = pd.read_csv('data/state-abbrevs.csv')

display(pop.head(), areas.head() , abbrevs.head())

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [158]:
merged = pd.merge(pop, abbrevs, how='outer',
                 left_on='state/region', right_on='abbreviation')
merged = merged.drop('abbreviation', axis=1)
merged.head()

  state/region     ages  year  population   state
0           AK    total  1990    553290.0  Alaska
1           AK  under18  1990    177502.0  Alaska
2           AK    total  1992    588736.0  Alaska
3           AK  under18  1991    182180.0  Alaska
4           AK  under18  1992    184878.0  Alaska

In [161]:
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

In [170]:
merged[merged['population'].isnull()].head()

     state/region     ages  year  population        state
1872           PR  under18  1990         NaN  Puerto Rico
1873           PR    total  1990         NaN  Puerto Rico
1874           PR    total  1991         NaN  Puerto Rico
1875           PR  under18  1991         NaN  Puerto Rico
1876           PR    total  1993         NaN  Puerto Rico

In [180]:
merged.loc[merged['state'].isna(), 'state/region'].unique()

array([], dtype=object)

In [192]:
merged.loc[merged['state/region'] == 'PR', 'state'] = 'Puerto Rico'
merged.loc[merged['state/region'] == 'USA', 'state'] = 'United States'
merged.isnull().any()

state/region    False
ages            False
year            False
population      False
state           False
dtype: bool

In [193]:
final = pd.merge(merged, areas, on='state', how='left')
final.head()

  state/region     ages  year population   state  area (sq. mi)
0           AK    total  1990   553290.0  Alaska       656425.0
1           AK  under18  1990   177502.0  Alaska       656425.0
2           AK    total  1992   588736.0  Alaska       656425.0
3           AK  under18  1991   182180.0  Alaska       656425.0
4           AK  under18  1992   184878.0  Alaska       656425.0

In [195]:
final.isnull().any()

state/region     False
ages             False
year             False
population       False
state            False
area (sq. mi)     True
dtype: bool

In [206]:
print(final.columns)
final.columns = final.columns.str.strip()  # Removes extra spaces
final['state'][final['area (sq. mi)'].isnull()].unique()
final.head()

Index(['state/region', 'ages', 'year', 'population', 'state', 'area (sq. mi)'], dtype='object')

  state/region     ages  year population   state  area (sq. mi)
0           AK    total  1990   553290.0  Alaska       656425.0
1           AK  under18  1990   177502.0  Alaska       656425.0
2           AK    total  1992   588736.0  Alaska       656425.0
3           AK  under18  1991   182180.0  Alaska       656425.0
4           AK  under18  1992   184878.0  Alaska       656425.0

In [209]:
data2010 = final.query("year == 2010 & ages == 'total'")
data2010.head()

    state/region   ages  year  population       state  area (sq. mi)
43            AK  total  2010    713868.0      Alaska       656425.0
51            AL  total  2010   4785570.0     Alabama        52423.0
141           AR  total  2010   2922280.0    Arkansas        53182.0
149           AZ  total  2010   6408790.0     Arizona       114006.0
197           CA  total  2010  37333601.0  California       163707.0

In [240]:
data2010.set_index('state', inplace=True)
density = data2010['population'] / data2010['area (sq. m)']

density.sort_values(ascending=False, inplace=True)
density.head()

KeyError: "None of ['state'] are in the columns"